In [1]:
import pandas as pd
import numpy as np

In [3]:
path = "../Data/Online_Data/trainning_data/corporate_attributes/"
outpath = "../Processed_Data/"

In [4]:
el_company_history_manager= pd.read_csv(path+"el_company_history_manager.csv")

<ipython-input-4-bbe608d9a68d>:1: FutureWarning: Your version of xlrd is 1.2.0. In xlrd >= 2.0, only the xls format is supported. As a result, the openpyxl engine will be used if it is installed and the engine argument is not specified. Install openpyxl instead.
  el_company_history_manager= pd.read_excel(path+"el_company_history_manager.xlsx")

In [5]:
el_company_history_manager.head()

       entid  NAME    indate   outdate
0  122697049  1030       NaN       NaN
1  122697049   801  201607.0  201612.0
2  122697049  1218  201607.0  201707.0
3  959830672  1871  201711.0  201711.0
4  564421968  1661  201612.0  201612.0

In [6]:
el_company_history_manager['indate']=el_company_history_manager['indate'].fillna(0)

In [7]:
el_company_history_manager.head()

       entid  NAME    indate   outdate
0  122697049  1030       0.0       NaN
1  122697049   801  201607.0  201612.0
2  122697049  1218  201607.0  201707.0
3  959830672  1871  201711.0  201711.0
4  564421968  1661  201612.0  201612.0

In [8]:
result= el_company_history_manager.groupby(['entid'])['indate'].count().reset_index(name="countofjoin")

In [9]:
result1= el_company_history_manager.groupby(['entid'])['outdate'].count().reset_index(name="countofleave")

In [10]:
# a = el_company_history_manager[el_company_history_manager.notnull()].groupby('entid')['NAME'].unique()
# result1["uniquemanager"]=pd.DataFrame.from_records(a.values.tolist()).stack().value_counts()

In [11]:
el_company_history_manager_Name = el_company_history_manager[["entid", "NAME"]].groupby("entid")
el_company_history_manager_Name = el_company_history_manager_Name.nunique()
el_company_history_manager_Name = el_company_history_manager_Name.reset_index()

In [12]:
result.head()

    entid  countofjoin
0  109606            2
1  221197            7
2  243165            1
3  285412            1
4  530656            2

In [13]:
result1.head()

    entid  countofleave
0  109606             2
1  221197             7
2  243165             1
3  285412             1
4  530656             1

In [14]:
el_company_history_manager_Name.head()

    entid  NAME
0  109606     2
1  221197     5
2  243165     1
3  285412     1
4  530656     2

In [15]:
el_company_history_manager_Name.columns = ['entid', 'Manager_Uniq']

In [16]:
df_new=pd.merge(result,result1,on="entid")

In [17]:
df_new1=pd.merge(df_new,el_company_history_manager_Name,on="entid")

In [18]:
df_new1.head()

    entid  countofjoin  countofleave  Manager_Uniq
0  109606            2             2             2
1  221197            7             7             5
2  243165            1             1             1
3  285412            1             1             1
4  530656            2             1             2

In [19]:
df_new1.to_csv(outpath+'el_company_history_manager_processed.csv', index=False)